; domain
(define (domain grid)
(:requirements :strips)
(:types place key shape)
(:predicates (conn ?x ?y - place)
             (key-shape ?k - key ?s - shape)
             (lock-shape ?p - place ?s - shape)
             (at ?k - key ?p - place)
	     (at-robot ?p - place)
             (locked ?p - place)
	     (open ?p - place)
             (holding ?k - key)             
             (arm-empty))

(:action unlock
  :parameters (?o1 ?o2 ?o3 ?o4)
  :precondition (and (conn ?o1 ?o2)
  		     (key-shape ?o3 ?o4)
		     (lock-shape ?o2 ?o4)
		     (at-robot ?o1)
		     (locked ?o2)
		     (holding ?o3))
  :effect (and  (open ?o2)
  	  	(not (locked ?o2))))

(:action move
  :parameters (?o1 ?o2)
  :precondition (and (at-robot ?o1)
  		     (conn ?o1 ?o2)
		     (open ?o2))
  :effect (and (at-robot ?o2)
  	       (not (at-robot ?o1))))

(:action pickup
  :parameters (?o1 ?o2)
  :precondition (and (at-robot ?o1)
  		     (at ?o2 ?o1)
		     (arm-empty))
  :effect (and (holding ?o2)
  	       (not (at ?o2 ?o1))
	       (not (arm-empty))))


(:action pickup-and-loose
  :parameters (?o1 ?o2 ?o3)
  :precondition (and (at-robot ?o1)
  		     (holding ?o3)
		     (at ?o2 ?o1))
  :effect (and (holding ?o2)
  	       (at ?o3 ?o1)
               (not (holding ?o3))
	       (not (at ?o2 ?o1))))

(:action putdown
  :parameters (?o1 ?o2)
  :precondition (and (at-robot ?o1)
  		     (holding ?o2))
  :effect (and (arm-empty)
  	       (at ?o2 ?o1)
	       (not (holding ?o2)))))

; problem
(define (problem strips-grid-y-2)
  (:domain grid)
  (:objects node0-1 -  place node0-0 -  place node0-2 -  place node1-0 -  place node0-3 -  place node1-1 -  place node1-2 -  place node1-3 -  place node2-0 -  place node2-1 -  place node2-2 -  place node2-3 -  place node3-0 -  place node3-1 -  place node3-2 -  place node3-3 -  place circle -  shape key0 -  key key1 -  key key2 -  key key3 -  key )
  (:init (open node3-0) (conn node2-1 node2-2) (conn node3-2 node2-2) (conn node1-3 node1-2) (conn node3-1 node3-0) (conn node2-1 node2-0) (conn node2-0 node3-0) (conn node0-3 node1-3) (open node0-0) (open node1-0) (conn node1-1 node1-2) (open node0-2) (conn node0-1 node1-1) (conn node1-1 node0-1) (open node0-1) (key-shape key2 circle) (open node1-2) (conn node2-2 node2-1) (lock-shape node3-3 circle) (conn node2-0 node1-0) (conn node0-2 node0-3) (conn node0-1 node0-0) (conn node1-2 node2-2) (conn node3-0 node2-0) (conn node1-2 node1-1) (conn node2-3 node1-3) (lock-shape node3-1 circle) (conn node3-3 node3-2) (conn node2-2 node3-2) (locked node3-2) (open node1-1) (conn node0-2 node1-2) (conn node1-0 node2-0) (conn node1-0 node0-0) (conn node2-1 node1-1) (conn node3-3 node2-3) (conn node2-3 node2-2) (key-shape key0 circle) (lock-shape node2-1 circle) (conn node0-2 node0-1) (conn node0-1 node0-2) (conn node0-0 node1-0) (conn node1-0 node1-1) (at key3 node2-3) (locked node3-1) (conn node1-3 node2-3) (key-shape key3 circle) (open node0-3) (conn node2-1 node3-1) (conn node3-1 node2-1) (conn node2-3 node3-3) (conn node2-2 node2-3) (conn node3-2 node3-1) (conn node0-3 node0-2) (conn node3-0 node3-1) (conn node0-0 node0-1) (lock-shape node3-2 circle) (conn node2-0 node2-1) (conn node1-1 node2-1) (lock-shape node2-2 circle) (conn node1-1 node1-0) (open node2-0) (locked node3-3) (conn node3-2 node3-3) (conn node1-2 node1-3) (lock-shape node1-3 circle) (conn node2-2 node1-2) (conn node1-2 node0-2) (key-shape key1 circle) (conn node3-1 node3-2) (conn node1-3 node0-3) (lock-shape node2-3 circle) (open node2-1) (open node1-3) (open node2-2) (open node2-3) (at key1 node1-3) (at key2 node1-2) (at-robot node1-1) (holding key0) )
  (:goal (and (open node3-0)(conn node2-1 node2-2)(conn node3-2 node2-2)(conn node1-3 node1-2)(conn node3-1 node3-0)(conn node2-1 node2-0)(conn node2-0 node3-0)(conn node0-3 node1-3)(open node0-0)(open node1-0)(conn node1-1 node1-2)(open node0-2)(conn node0-1 node1-1)(conn node1-1 node0-1)(open node0-1)(key-shape key2 circle)(open node1-2)(conn node2-2 node2-1)(lock-shape node3-3 circle)(conn node2-0 node1-0)(conn node0-2 node0-3)(conn node0-1 node0-0)(conn node1-2 node2-2)(conn node3-0 node2-0)(conn node1-2 node1-1)(conn node2-3 node1-3)(lock-shape node3-1 circle)(conn node3-3 node3-2)(conn node2-2 node3-2)(locked node3-2)(open node1-1)(conn node0-2 node1-2)(conn node1-0 node2-0)(conn node1-0 node0-0)(conn node2-1 node1-1)(conn node3-3 node2-3)(conn node2-3 node2-2)(key-shape key0 circle)(lock-shape node2-1 circle)(conn node0-2 node0-1)(conn node0-1 node0-2)(conn node0-0 node1-0)(conn node1-0 node1-1)(at key3 node2-3)(locked node3-1)(conn node1-3 node2-3)(key-shape key3 circle)(open node0-3)(conn node2-1 node3-1)(conn node3-1 node2-1)(conn node2-3 node3-3)(conn node2-2 node2-3)(conn node3-2 node3-1)(conn node0-3 node0-2)(conn node3-0 node3-1)(conn node0-0 node0-1)(lock-shape node3-2 circle)(conn node2-0 node2-1)(conn node1-1 node2-1)(lock-shape node2-2 circle)(conn node1-1 node1-0)(open node2-0)(locked node3-3)(conn node3-2 node3-3)(conn node1-2 node1-3)(lock-shape node1-3 circle)(conn node2-2 node1-2)(conn node1-2 node0-2)(key-shape key1 circle)(conn node3-1 node3-2)(conn node1-3 node0-3)(lock-shape node2-3 circle)(open node2-1)(open node1-3)(open node2-2)(open node2-3)(at key0 node1-2)(holding key1)(at key2 node1-3)(at-robot node2-3)(not (conn node0-0 node0-0))(not (conn node0-0 node0-2))(not (conn node0-0 node0-3))(not (conn node0-0 node1-1))(not (conn node0-0 node1-2))(not (conn node0-0 node1-3))(not (conn node0-0 node2-0))(not (conn node0-0 node2-1))(not (conn node0-0 node2-2))(not (conn node0-0 node2-3))(not (conn node0-0 node3-0))(not (conn node0-0 node3-1))(not (conn node0-0 node3-2))(not (conn node0-0 node3-3))(not (conn node0-1 node0-1))(not (conn node0-1 node0-3))(not (conn node0-1 node1-0))(not (conn node0-1 node1-2))(not (conn node0-1 node1-3))(not (conn node0-1 node2-0))(not (conn node0-1 node2-1))(not (conn node0-1 node2-2))(not (conn node0-1 node2-3))(not (conn node0-1 node3-0))(not (conn node0-1 node3-1))(not (conn node0-1 node3-2))(not (conn node0-1 node3-3))(not (conn node0-2 node0-0))(not (conn node0-2 node0-2))(not (conn node0-2 node1-0))(not (conn node0-2 node1-1))(not (conn node0-2 node1-3))(not (conn node0-2 node2-0))(not (conn node0-2 node2-1))(not (conn node0-2 node2-2))(not (conn node0-2 node2-3))(not (conn node0-2 node3-0))(not (conn node0-2 node3-1))(not (conn node0-2 node3-2))(not (conn node0-2 node3-3))(not (conn node0-3 node0-0))(not (conn node0-3 node0-1))(not (conn node0-3 node0-3))(not (conn node0-3 node1-0))(not (conn node0-3 node1-1))(not (conn node0-3 node1-2))(not (conn node0-3 node2-0))(not (conn node0-3 node2-1))(not (conn node0-3 node2-2))(not (conn node0-3 node2-3))(not (conn node0-3 node3-0))(not (conn node0-3 node3-1))(not (conn node0-3 node3-2))(not (conn node0-3 node3-3))(not (conn node1-0 node0-1))(not (conn node1-0 node0-2))(not (conn node1-0 node0-3))(not (conn node1-0 node1-0))(not (conn node1-0 node1-2))(not (conn node1-0 node1-3))(not (conn node1-0 node2-1))(not (conn node1-0 node2-2))(not (conn node1-0 node2-3))(not (conn node1-0 node3-0))(not (conn node1-0 node3-1))(not (conn node1-0 node3-2))(not (conn node1-0 node3-3))(not (conn node1-1 node0-0))(not (conn node1-1 node0-2))(not (conn node1-1 node0-3))(not (conn node1-1 node1-1))(not (conn node1-1 node1-3))(not (conn node1-1 node2-0))(not (conn node1-1 node2-2))(not (conn node1-1 node2-3))(not (conn node1-1 node3-0))(not (conn node1-1 node3-1))(not (conn node1-1 node3-2))(not (conn node1-1 node3-3))(not (conn node1-2 node0-0))(not (conn node1-2 node0-1))(not (conn node1-2 node0-3))(not (conn node1-2 node1-0))(not (conn node1-2 node1-2))(not (conn node1-2 node2-0))(not (conn node1-2 node2-1))(not (conn node1-2 node2-3))(not (conn node1-2 node3-0))(not (conn node1-2 node3-1))(not (conn node1-2 node3-2))(not (conn node1-2 node3-3))(not (conn node1-3 node0-0))(not (conn node1-3 node0-1))(not (conn node1-3 node0-2))(not (conn node1-3 node1-0))(not (conn node1-3 node1-1))(not (conn node1-3 node1-3))(not (conn node1-3 node2-0))(not (conn node1-3 node2-1))(not (conn node1-3 node2-2))(not (conn node1-3 node3-0))(not (conn node1-3 node3-1))(not (conn node1-3 node3-2))(not (conn node1-3 node3-3))(not (conn node2-0 node0-0))(not (conn node2-0 node0-1))(not (conn node2-0 node0-2))(not (conn node2-0 node0-3))(not (conn node2-0 node1-1))(not (conn node2-0 node1-2))(not (conn node2-0 node1-3))(not (conn node2-0 node2-0))(not (conn node2-0 node2-2))(not (conn node2-0 node2-3))(not (conn node2-0 node3-1))(not (conn node2-0 node3-2))(not (conn node2-0 node3-3))(not (conn node2-1 node0-0))(not (conn node2-1 node0-1))(not (conn node2-1 node0-2))(not (conn node2-1 node0-3))(not (conn node2-1 node1-0))(not (conn node2-1 node1-2))(not (conn node2-1 node1-3))(not (conn node2-1 node2-1))(not (conn node2-1 node2-3))(not (conn node2-1 node3-0))(not (conn node2-1 node3-2))(not (conn node2-1 node3-3))(not (conn node2-2 node0-0))(not (conn node2-2 node0-1))(not (conn node2-2 node0-2))(not (conn node2-2 node0-3))(not (conn node2-2 node1-0))(not (conn node2-2 node1-1))(not (conn node2-2 node1-3))(not (conn node2-2 node2-0))(not (conn node2-2 node2-2))(not (conn node2-2 node3-0))(not (conn node2-2 node3-1))(not (conn node2-2 node3-3))(not (conn node2-3 node0-0))(not (conn node2-3 node0-1))(not (conn node2-3 node0-2))(not (conn node2-3 node0-3))(not (conn node2-3 node1-0))(not (conn node2-3 node1-1))(not (conn node2-3 node1-2))(not (conn node2-3 node2-0))(not (conn node2-3 node2-1))(not (conn node2-3 node2-3))(not (conn node2-3 node3-0))(not (conn node2-3 node3-1))(not (conn node2-3 node3-2))(not (conn node3-0 node0-0))(not (conn node3-0 node0-1))(not (conn node3-0 node0-2))(not (conn node3-0 node0-3))(not (conn node3-0 node1-0))(not (conn node3-0 node1-1))(not (conn node3-0 node1-2))(not (conn node3-0 node1-3))(not (conn node3-0 node2-1))(not (conn node3-0 node2-2))(not (conn node3-0 node2-3))(not (conn node3-0 node3-0))(not (conn node3-0 node3-2))(not (conn node3-0 node3-3))(not (conn node3-1 node0-0))(not (conn node3-1 node0-1))(not (conn node3-1 node0-2))(not (conn node3-1 node0-3))(not (conn node3-1 node1-0))(not (conn node3-1 node1-1))(not (conn node3-1 node1-2))(not (conn node3-1 node1-3))(not (conn node3-1 node2-0))(not (conn node3-1 node2-2))(not (conn node3-1 node2-3))(not (conn node3-1 node3-1))(not (conn node3-1 node3-3))(not (conn node3-2 node0-0))(not (conn node3-2 node0-1))(not (conn node3-2 node0-2))(not (conn node3-2 node0-3))(not (conn node3-2 node1-0))(not (conn node3-2 node1-1))(not (conn node3-2 node1-2))(not (conn node3-2 node1-3))(not (conn node3-2 node2-0))(not (conn node3-2 node2-1))(not (conn node3-2 node2-3))(not (conn node3-2 node3-0))(not (conn node3-2 node3-2))(not (conn node3-3 node0-0))(not (conn node3-3 node0-1))(not (conn node3-3 node0-2))(not (conn node3-3 node0-3))(not (conn node3-3 node1-0))(not (conn node3-3 node1-1))(not (conn node3-3 node1-2))(not (conn node3-3 node1-3))(not (conn node3-3 node2-0))(not (conn node3-3 node2-1))(not (conn node3-3 node2-2))(not (conn node3-3 node3-0))(not (conn node3-3 node3-1))(not (conn node3-3 node3-3))(not (lock-shape node0-0 circle))(not (lock-shape node0-1 circle))(not (lock-shape node0-2 circle))(not (lock-shape node0-3 circle))(not (lock-shape node1-0 circle))(not (lock-shape node1-1 circle))(not (lock-shape node1-2 circle))(not (lock-shape node2-0 circle))(not (lock-shape node3-0 circle))(not (at key0 node0-0))(not (at key0 node0-1))(not (at key0 node0-2))(not (at key0 node0-3))(not (at key0 node1-0))(not (at key0 node1-1))(not (at key0 node1-3))(not (at key0 node2-0))(not (at key0 node2-1))(not (at key0 node2-2))(not (at key0 node2-3))(not (at key0 node3-0))(not (at key0 node3-1))(not (at key0 node3-2))(not (at key0 node3-3))(not (at key1 node0-0))(not (at key1 node0-1))(not (at key1 node0-2))(not (at key1 node0-3))(not (at key1 node1-0))(not (at key1 node1-1))(not (at key1 node1-2))(not (at key1 node1-3))(not (at key1 node2-0))(not (at key1 node2-1))(not (at key1 node2-2))(not (at key1 node2-3))(not (at key1 node3-0))(not (at key1 node3-1))(not (at key1 node3-2))(not (at key1 node3-3))(not (at key2 node0-0))(not (at key2 node0-1))(not (at key2 node0-2))(not (at key2 node0-3))(not (at key2 node1-0))(not (at key2 node1-1))(not (at key2 node1-2))(not (at key2 node2-0))(not (at key2 node2-1))(not (at key2 node2-2))(not (at key2 node2-3))(not (at key2 node3-0))(not (at key2 node3-1))(not (at key2 node3-2))(not (at key2 node3-3))(not (at key3 node0-0))(not (at key3 node0-1))(not (at key3 node0-2))(not (at key3 node0-3))(not (at key3 node1-0))(not (at key3 node1-1))(not (at key3 node1-2))(not (at key3 node1-3))(not (at key3 node2-0))(not (at key3 node2-1))(not (at key3 node2-2))(not (at key3 node3-0))(not (at key3 node3-1))(not (at key3 node3-2))(not (at key3 node3-3))(not (at-robot node0-0))(not (at-robot node0-1))(not (at-robot node0-2))(not (at-robot node0-3))(not (at-robot node1-0))(not (at-robot node1-1))(not (at-robot node1-2))(not (at-robot node1-3))(not (at-robot node2-0))(not (at-robot node2-1))(not (at-robot node2-2))(not (at-robot node3-0))(not (at-robot node3-1))(not (at-robot node3-2))(not (at-robot node3-3))(not (locked node0-0))(not (locked node0-1))(not (locked node0-2))(not (locked node0-3))(not (locked node1-0))(not (locked node1-1))(not (locked node1-2))(not (locked node1-3))(not (locked node2-0))(not (locked node2-1))(not (locked node2-2))(not (locked node2-3))(not (locked node3-0))(not (open node3-1))(not (open node3-2))(not (open node3-3))(not (holding key0))(not (holding key2))(not (holding key3))(not (arm-empty )))))

; plan
1. (move node1-1 node1-2)
   deleted: (at-robot node1-1)
   added: (at-robot node1-2)
   goals met: 385 of 393
2. (pickup-and-loose node1-2 key2 key0)
   deleted: (holding key0) (at key2 node1-2)
   added: (holding key2) (at key0 node1-2)
   goals met: 387 of 393
3. (move node1-2 node1-3)
   deleted: (at-robot node1-2)
   added: (at-robot node1-3)
   goals met: 387 of 393
4. (pickup-and-loose node1-3 key1 key2)
   deleted: (holding key2) (at key1 node1-3)
   added: (holding key1) (at key2 node1-3)
   goals met: 391 of 393
5. (move node1-3 node2-3)
   deleted: (at-robot node1-3)
   added: (at-robot node2-3)
   goals met: 393 of 393
